In [1]:
%matplotlib notebook

In [2]:
# Dependencies

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os

# Ignore Warnings

import warnings
warnings.filterwarnings('ignore')

In [3]:
# Take in all of our name data (.csv files) and read it into pandas

yob1991 = "DATA SET/yob1991.csv"
yob1992 = "DATA SET/yob1992.csv"
yob1993 = "DATA SET/yob1993.csv"
yob1994 = "DATA SET/yob1994.csv"
yob1995 = "DATA SET/yob1995.csv"
yob1996 = "DATA SET/yob1996.csv"
yob1997 = "DATA SET/yob1997.csv"
yob1998 = "DATA SET/yob1998.csv"
yob1999 = "DATA SET/yob1999.csv"
yob2000 = "DATA SET/yob2000.csv"
yob2001 = "DATA SET/yob2001.csv"
yob2002 = "DATA SET/yob2002.csv"
yob2003 = "DATA SET/yob2003.csv"
yob2004 = "DATA SET/yob2004.csv"
yob2005 = "DATA SET/yob2005.csv"
yob2006 = "DATA SET/yob2006.csv"
yob2007 = "DATA SET/yob2007.csv"
yob2008 = "DATA SET/yob2008.csv"
yob2009 = "DATA SET/yob2009.csv"
yob2010 = "DATA SET/yob2010.csv"
yob2011 = "DATA SET/yob2011.csv"
yob2012 = "DATA SET/yob2012.csv"
yob2013 = "DATA SET/yob2013.csv"
yob2014 = "DATA SET/yob2014.csv"
yob2015 = "DATA SET/yob2015.csv"
yob2016 = "DATA SET/yob2016.csv"
yob2017 = "DATA SET/yob2017.csv"
yob2018 = "DATA SET/yob2018.csv"

# Create dataframes for each .csv file (e.g. df for each year from 1991 to 2018)

yob1991_df = pd.read_csv(yob1991)
yob1992_df = pd.read_csv(yob1992)
yob1993_df = pd.read_csv(yob1993)
yob1994_df = pd.read_csv(yob1994)
yob1995_df = pd.read_csv(yob1995)
yob1996_df = pd.read_csv(yob1996)
yob1997_df = pd.read_csv(yob1997)
yob1998_df = pd.read_csv(yob1998)
yob1999_df = pd.read_csv(yob1999)
yob2000_df = pd.read_csv(yob2000)
yob2001_df = pd.read_csv(yob2001)
yob2002_df = pd.read_csv(yob2002)
yob2003_df = pd.read_csv(yob2003)
yob2004_df = pd.read_csv(yob2004)
yob2005_df = pd.read_csv(yob2005)
yob2006_df = pd.read_csv(yob2006)
yob2007_df = pd.read_csv(yob2007)
yob2008_df = pd.read_csv(yob2008)
yob2009_df = pd.read_csv(yob2009)
yob2010_df = pd.read_csv(yob2010)
yob2011_df = pd.read_csv(yob2011)
yob2012_df = pd.read_csv(yob2012)
yob2013_df = pd.read_csv(yob2013)
yob2014_df = pd.read_csv(yob2014)
yob2015_df = pd.read_csv(yob2015)
yob2016_df = pd.read_csv(yob2016)
yob2017_df = pd.read_csv(yob2017)
yob2018_df = pd.read_csv(yob2018)

In [4]:
# Create a header to each df

yob1991_df.columns =['Name', 'Gender', 'Count']
yob1992_df.columns =['Name', 'Gender', 'Count']
yob1993_df.columns =['Name', 'Gender', 'Count']
yob1994_df.columns =['Name', 'Gender', 'Count']
yob1995_df.columns =['Name', 'Gender', 'Count']
yob1996_df.columns =['Name', 'Gender', 'Count']
yob1997_df.columns =['Name', 'Gender', 'Count']
yob1998_df.columns =['Name', 'Gender', 'Count']
yob1999_df.columns =['Name', 'Gender', 'Count']
yob2000_df.columns =['Name', 'Gender', 'Count']
yob2001_df.columns =['Name', 'Gender', 'Count']
yob2002_df.columns =['Name', 'Gender', 'Count']
yob2003_df.columns =['Name', 'Gender', 'Count']
yob2004_df.columns =['Name', 'Gender', 'Count']
yob2005_df.columns =['Name', 'Gender', 'Count']
yob2006_df.columns =['Name', 'Gender', 'Count']
yob2007_df.columns =['Name', 'Gender', 'Count']
yob2008_df.columns =['Name', 'Gender', 'Count']
yob2009_df.columns =['Name', 'Gender', 'Count']
yob2010_df.columns =['Name', 'Gender', 'Count']
yob2011_df.columns =['Name', 'Gender', 'Count']
yob2012_df.columns =['Name', 'Gender', 'Count']
yob2013_df.columns =['Name', 'Gender', 'Count']
yob2014_df.columns =['Name', 'Gender', 'Count']
yob2015_df.columns =['Name', 'Gender', 'Count']
yob2016_df.columns =['Name', 'Gender', 'Count']
yob2017_df.columns =['Name', 'Gender', 'Count']
yob2018_df.columns =['Name', 'Gender', 'Count']

In [5]:
# Merge the first two datasets on "Name" 
combined_name_df = pd.merge(yob1991_df, yob1992_df, how='outer', on=['Name', 'Gender'])
# Rename our _x and _y columns to "Count 1991", "Count 1992"
combined_name_df = combined_name_df.rename(columns={"Count_x":"Count 1991", "Count_y": "Count 1992"})

# Merge combined data with dataset 1993
combined_name_df = pd.merge(combined_name_df, yob1993_df, how='outer', on=['Name', 'Gender'])
# Rename columns 
combined_name_df = combined_name_df.rename(columns={"Count":"Count 1993"})

# Merge combined data with dataset 1994
combined_name_df = pd.merge(combined_name_df, yob1994_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 1994"})

# Merge combined data with dataset 1995
combined_name_df = pd.merge(combined_name_df, yob1995_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 1995"})

# Merge combined data with dataset 1996
combined_name_df = pd.merge(combined_name_df, yob1996_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 1996"})

# Merge combined data with dataset 1997
combined_name_df = pd.merge(combined_name_df, yob1997_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 1997"})

# Merge combined data with dataset 1998
combined_name_df = pd.merge(combined_name_df, yob1998_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 1998"})

# Merge combined data with dataset 1999
combined_name_df = pd.merge(combined_name_df, yob1999_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 1999"})

In [6]:
# Merge combined data with dataset 2000
combined_name_df = pd.merge(combined_name_df, yob2000_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2000"})

# Merge combined data with dataset 2001
combined_name_df = pd.merge(combined_name_df, yob2001_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2001"})

# Merge combined data with dataset 2002
combined_name_df = pd.merge(combined_name_df, yob2002_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2002"})

# Merge combined data with dataset 2003
combined_name_df = pd.merge(combined_name_df, yob2003_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2003"})

# Merge combined data with dataset 2004
combined_name_df = pd.merge(combined_name_df, yob2004_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2004"})

# Merge combined data with dataset 2005
combined_name_df = pd.merge(combined_name_df, yob2005_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2005"})

# Merge combined data with dataset 2006
combined_name_df = pd.merge(combined_name_df, yob2002_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2006"})

# Merge combined data with dataset 2007
combined_name_df = pd.merge(combined_name_df, yob2007_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2007"})

# Merge combined data with dataset 2008
combined_name_df = pd.merge(combined_name_df, yob2008_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2008"})

In [7]:
# Merge combined data with dataset 2009
combined_name_df = pd.merge(combined_name_df, yob2009_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2009"})

# Merge combined data with dataset 2010
combined_name_df = pd.merge(combined_name_df, yob2010_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2010"})

# Merge combined data with dataset 2011
combined_name_df = pd.merge(combined_name_df, yob2011_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2011"})

# Merge combined data with dataset 2012
combined_name_df = pd.merge(combined_name_df, yob2012_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2012"})

# Merge combined data with dataset 2013
combined_name_df = pd.merge(combined_name_df, yob2013_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2013"})

# Merge combined data with dataset 2014
combined_name_df = pd.merge(combined_name_df, yob2014_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2014"})

# Merge combined data with dataset 2015
combined_name_df = pd.merge(combined_name_df, yob2015_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2015"})

# Merge combined data with dataset 2016
combined_name_df = pd.merge(combined_name_df, yob2016_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2016"})

# Merge combined data with dataset 2017
combined_name_df = pd.merge(combined_name_df, yob2017_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2017"})

# Merge combined data with dataset 2018
combined_name_df = pd.merge(combined_name_df, yob2018_df, how='outer', on=['Name', 'Gender'])
# Rename columns
combined_name_df = combined_name_df.rename(columns={"Count":"Count 2018"})

In [8]:
# Replace NaN in df with the value zero
combined_name_df = combined_name_df.fillna(0)

# Sort combined df in alphabetical order by "Name"
combined_name_df.sort_values(by=['Name'], inplace=True)

# Save combined_name_df to a csv file
combined_name_df.to_csv(r'DATA SET/Combined_Names_1991_2018.csv')

# Print df
#combined_name_df

In [9]:
# Search through df for GOT male character names

# Jon and Jaimie are GOT male character names 
# that we decided to not include because 
# those are popular names regardless of any GOT influence

male_names_df = combined_name_df[(combined_name_df['Name'] == "Joffrey") | 
                 (combined_name_df['Name'] == "Jorah") | 
                 (combined_name_df['Name'] == "Bran") | 
                 (combined_name_df['Name'] == "Theon") | 
                 (combined_name_df['Name'] == "Tyrion") | 
                 (combined_name_df['Name'] == "Davos") | 
                 (combined_name_df['Name'] == "Stannis") | 
                 (combined_name_df['Name'] == "Bronn") | 
                 (combined_name_df['Name'] == "Stark") | 
                 (combined_name_df['Name'] == "Ramsay")]

# Sort df in alphabetical order by "Name"
male_names_df.sort_values('Name', ascending=True)

# Print df
male_names_df

,Name,Gender,Count 1991,Count 1992,Count 1993,Count 1994,Count 1995,Count 1996,Count 1997,Count 1998,...,Count 2009,Count 2010,Count 2011,Count 2012,Count 2013,Count 2014,Count 2015,Count 2016,Count 2017,Count 2018
51037,Bran,M,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,5.0,7.0,10.0,12.0,7.0,12.0,13.0,11.0,8.0
80988,Bronn,M,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,7.0,6.0,7.0
22339,Joffrey,M,7.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
78153,Jorah,M,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,7.0,13.0,11.0,22.0,30.0
49310,Jorah,F,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
28817,Ramsay,M,0.0,8.0,0.0,8.0,6.0,7.0,5.0,8.0,...,10.0,8.0,7.0,7.0,11.0,8.0,6.0,8.0,16.0,10.0
42408,Ramsay,F,0.0,0.0,0.0,0.0,0.0,0.0,7.0,5.0,...,0.0,0.0,0.0,6.0,5.0,0.0,5.0,0.0,9.0,5.0
72058,Stark,M,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,5.0,10.0,16.0,21.0,20.0,16.0,18.0,15.0,13.0
22657,Theon,M,7.0,0.0,0.0,0.0,0.0,0.0,6.0,6.0,...,7.0,0.0,0.0,12.0,15.0,11.0,12.0,16.0,23.0,14.0
44354,Tyrion,M,0.0,0.0,0.0,0.0,0.0,0.0,5.0,5.0,...,17.0,11.0,18.0,20.0,44.0,60.0,62.0,58.0,55.0,58.0
44706,Tyrion,F,0.0,0.0,0.0,0.0,0.0,0.0,0.0,7.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [10]:
# Create a new column named "Total Count"
# Calculate the total count of each GOT name throughout the years 1991 - 2018

def total_male_name_count(df, new_column, years):
    df[new_column] = df[years].astype(float).sum(axis=1)
    return(df)
total_male_name_count(male_names_df, 'Total Count', ['Count 1991','Count 1992','Count 1993', 'Count 1994', 'Count 1995',
                                                        'Count 1996', 'Count 1997', 'Count 1998', 'Count 1999', 'Count 2000',
                                                        'Count 2001', 'Count 2002', 'Count 2003', 'Count 2004', 'Count 2005',
                                                        'Count 2006', 'Count 2007', 'Count 2008', 'Count 2009', 'Count 2010',
                                                        'Count 2011', 'Count 2012', 'Count 2013', 'Count 2014', 'Count 2015',
                                                        'Count 2016', 'Count 2017', 'Count 2018'])


# Copy male_names_df to a new df
male_names_total = male_names_df

# Print columns 'Name' and 'Total Count' only
male_names_total = male_names_total[['Name','Total Count']]

# Combine total counts for duplicate names (e.g. Arya)
male_names_total = male_names_total.groupby(['Name']).agg({'Total Count': 'sum'})

# Sort df in ascending order by "Total Count"
male_names_total.sort_values('Total Count', ascending=False, inplace=True)

# Save male_names_total to a csv file
male_names_total.to_csv(r'DATA SET/GOT_Male_Names_1991_2018.csv')

#Print df
male_names_total

         Total Count
Name
Tyrion         550.0
Ramsay         239.0
Theon          139.0
Stark          134.0
Jorah          112.0
Bran           103.0
Bronn           20.0
Joffrey          7.0

In [11]:
# No babies named after Davos, Stannis

# TOP 3: Tyrion, Ramsay, Theon
# Scatter plot for each name (TOP 3)

In [12]:
# Search through df for GOT female character names
female_names_df = combined_name_df[(combined_name_df['Name'] == "Cersei") | 
                 (combined_name_df['Name'] == "Khaleesi") | 
                 (combined_name_df['Name'] == "Sansa") | 
                 (combined_name_df['Name'] == "Arya") | 
                 (combined_name_df['Name'] == "Melisandre") | 
                 (combined_name_df['Name'] == "Margaery") | 
                 (combined_name_df['Name'] == "Brienne") | 
                 (combined_name_df['Name'] == "Lyanna") | 
                 (combined_name_df['Name'] == "Meera") | 
                 (combined_name_df['Name'] == "Daenerys")]

# Sort df in ascending order by "Name"
female_names_df.sort_values('Name', ascending=True)

# Print df
female_names_df

,Name,Gender,Count 1991,Count 1992,Count 1993,Count 1994,Count 1995,Count 1996,Count 1997,Count 1998,...,Count 2009,Count 2010,Count 2011,Count 2012,Count 2013,Count 2014,Count 2015,Count 2016,Count 2017,Count 2018
25845,Arya,F,0.0,7.0,0.0,0.0,0.0,11.0,13.0,25.0,...,237.0,273.0,387.0,759.0,1138.0,1554.0,1642.0,1896.0,2163.0,2545.0
17605,Arya,M,34.0,29.0,26.0,15.0,30.0,25.0,31.0,33.0,...,113.0,88.0,111.0,77.0,77.0,82.0,90.0,54.0,46.0,49.0
4070,Brienne,F,25.0,21.0,26.0,22.0,18.0,30.0,33.0,23.0,...,21.0,20.0,14.0,18.0,8.0,18.0,31.0,29.0,35.0,33.0
81543,Cersei,F,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,11.0,0.0
73888,Daenerys,F,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,21.0,68.0,86.0,82.0,101.0,110.0,163.0
72127,Khaleesi,F,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,28.0,147.0,243.0,369.0,341.0,373.0,467.0,560.0
12436,Lyanna,F,6.0,10.0,8.0,8.0,10.0,11.0,16.0,15.0,...,39.0,44.0,33.0,46.0,62.0,59.0,62.0,216.0,318.0,319.0
3505,Meera,F,31.0,36.0,31.0,38.0,39.0,51.0,63.0,46.0,...,80.0,101.0,80.0,82.0,156.0,174.0,186.0,198.0,182.0,191.0
75626,Sansa,F,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,11.0,12.0,20.0,26.0,20.0,29.0

In [13]:
# Create a new column named "Total Count"
# Calculate the total count of each GOT name throughout the years 1991 - 2018

def total_female_name_count(df, new_column, years):
    df[new_column] = df[years].astype(float).sum(axis=1)
    return(df)

total_female_name_count(female_names_df, 'Total Count', ['Count 1991','Count 1992','Count 1993', 'Count 1994', 'Count 1995',
                                                        'Count 1996', 'Count 1997', 'Count 1998', 'Count 1999', 'Count 2000',
                                                        'Count 2001', 'Count 2002', 'Count 2003', 'Count 2004', 'Count 2005',
                                                        'Count 2006', 'Count 2007', 'Count 2008', 'Count 2009', 'Count 2010',
                                                        'Count 2011', 'Count 2012', 'Count 2013', 'Count 2014', 'Count 2015',
                                                        'Count 2016', 'Count 2017', 'Count 2018'])


# Copy female_names_df to a new df
female_names_total = female_names_df

# Print columns 'Name' and 'Total Count' only
female_names_total = female_names_total[['Name','Total Count']]

# Combine total counts for duplicate names (e.g. Arya)
female_names_total = female_names_total.groupby(['Name']).agg({'Total Count': 'sum'})

# Sort df in ascending order by "Total Count"
female_names_total.sort_values('Total Count', ascending=False, inplace=True)

# Save female_names_total to a csv file
female_names_total.to_csv(r'DATA SET/GOT_Female_Names_1991_2018.csv')

#Print df
female_names_total

          Total Count
Name
Arya          15318.0
Khaleesi       2528.0
Meera          2446.0
Lyanna         1521.0
Daenerys        631.0
Brienne         590.0
Sansa           118.0
Cersei           11.0

In [14]:
# No babies named after Melisandre, Margaery

# TOP 3: Arya, Khaleesi, Meera
# Scatter plot for each name (TOP 3)

In [15]:
# Total male GOT names
# Male GOT names are more popular than female GOT names

male_names_total.sum(axis = 0, skipna = True)

Total Count    1304.0
dtype: float64

In [16]:
# Total female GOT names
female_names_total.sum(axis = 0, skipna = True)

Total Count    23163.0
dtype: float64

In [17]:
# Copy male_names_df to a new df
male_names_yearly = male_names_df

# Add total number GOT male names for each year
male_names_yearly.loc['Total',:]= male_names_yearly.sum(axis=0)

# Drop "Name" and "Gender" column
# Print "Count" for each year only
male_names_yearly.drop(columns=['Name', 'Gender'])

male_names_yearly_data = male_names_yearly.iloc[-1, 2:-1]
yearly_male_data = pd.DataFrame(data=male_names_yearly_data)
yearly_male_data

           Total
Count 1991    14
Count 1992     8
Count 1993     0
Count 1994     8
Count 1995     6
Count 1996     7
Count 1997    23
Count 1998    31
Count 1999     8
Count 2000    38
Count 2001    28
Count 2002    22
Count 2003    19
Count 2004    28
Count 2005    20
Count 2006    22
Count 2007    28
Count 2008    38
Count 2009    34
Count 2010    29
Count 2011    42
Count 2012    71
Count 2013   108
Count 2014   113
Count 2015   126
Count 2016   131
Count 2017   157
Count 2018   145

In [18]:
# Line or Scatter plot for 1991 to 2018 (ENTIRE GOT CAREER)
# X-axis - Years(1991 to 2018)
# Y - axis - Total Count over the years

In [19]:
# Line or Scatter plot for 1991 to 2010 (GOT BOOK YEARS)
# X-axis - Years
# Y - axis - Total Count over the years

In [20]:
# Line or Scatter plot for 2006 to 2018 (GOT SHOW YEARS)
# X-axis - Years
# Y - axis - Total Count over the years

In [21]:
# Copy female_names_df to a new df
female_names_yearly = female_names_df

# Add total number GOT female names for each year
female_names_yearly.loc['Total',:]= female_names_yearly.sum(axis=0)

# Drop "Name" and "Gender" column
# Print "Count" for each year only
female_names_yearly.drop(columns=['Name', 'Gender'])

female_names_yearly_data = female_names_yearly.iloc[-1, 2:-1]
yearly_female_data = pd.DataFrame(data=female_names_yearly_data)
yearly_female_data

           Total
Count 1991    96
Count 1992   103
Count 1993    91
Count 1994    83
Count 1995    97
Count 1996   128
Count 1997   156
Count 1998   142
Count 1999   141
Count 2000   155
Count 2001   170
Count 2002   240
Count 2003   275
Count 2004   326
Count 2005   300
Count 2006   240
Count 2007   430
Count 2008   466
Count 2009   490
Count 2010   526
Count 2011   653
Count 2012  1150
Count 2013  1763
Count 2014  2354
Count 2015  2454
Count 2016  2893
Count 2017  3352
Count 2018  3889

In [22]:
# Line or Scatter plot for 1991 to 2018 (ENTIRE GOT CAREER)
# X-axis - Years(1991 to 2018)
# Y - axis - Total Count over the years

In [23]:
# Line or Scatter plot for 1991 to 2010 (GOT BOOK YEARS)
# X-axis - Years
# Y - axis - Total Count over the years

In [24]:
# Line or Scatter plot for 2006 to 2018 (GOT SHOW YEARS)
# X-axis - Years
# Y - axis - Total Count over the years